In [1]:
import pandas as pd

In [9]:
df1 = pd.read_csv("companies.csv")
df1.head()

,permalink,name,homepage_url,category_list,market,funding_total_usd,status,country_code,state_code,region,city,funding_rounds,founded_at,founded_month,founded_quarter,founded_year,first_funding_at,last_funding_at
0,/organization/waywire,#waywire,http://www.waywire.com,|Entertainment|Politics|Social Media|News|,News,1 750 000,acquired,USA,NY,New York City,New York,1,01/06/2012,2012-06,2012-Q2,2012.0,30/06/2012,30/06/2012
1,/organization/tv-communications,&TV Communications,http://enjoyandtv.com,|Games|,Games,4 000 000,operating,USA,CA,Los Angeles,Los Angeles,2,NaN,NaN,NaN,NaN,04/06/2010,23/09/2010
2,/organization/rock-your-paper,'Rock' Your Paper,http://www.rockyourpaper.org,|Publishing|Education|,Publishing,40 000,operating,EST,NaN,Tallinn,Tallinn,1,26/10/2012,2012-10,2012-Q4,2012.0,09/08/2012,09/08/2012
3,/organization/in-touch-network,(In)Touch Network,http://www.InTouchNetwork.com,|Electronics|Guides|Coffee|Restaurants|Music|i...,Electronics,1 500 000,operating,GBR,NaN,London,London,1,01/04/2011,2011-04,2011-Q2,2011.0,01/04/2011,01/04/2011
4,/organization/n-plusn,+n (PlusN),http://plusn.com,|Software|,Software,1 200 000,operating,USA,NY,New York City,New York,2,01/01/2012,2012-01,2012-Q1,2012.0,29/08/2012,04/09/2014

In [10]:
df1 = df1[['name']]
df1.head()

                 name
0            #waywire
1  &TV Communications
2   'Rock' Your Paper
3   (In)Touch Network
4          +n (PlusN)

In [11]:
df1.shape

(6180, 1)

In [12]:
df1.columns = ['name']

In [13]:
df1.head()

                 name
0            #waywire
1  &TV Communications
2   'Rock' Your Paper
3   (In)Touch Network
4          +n (PlusN)

In [14]:
import sklearn
df1 = sklearn.utils.shuffle(df1)

In [15]:
df1.head()

                                          name
5819                                    Boonty
503                                     Abazab
3732                          Automation Alley
5839  Bootstrap Digital and Tech Ventures Inc.
2715                            AppIt Ventures

In [20]:
df1 = df1[:180]

In [21]:
df1.head()

                                          name
5819                                    Boonty
503                                     Abazab
3732                          Automation Alley
5839  Bootstrap Digital and Tech Ventures Inc.
2715                            AppIt Ventures

In [22]:
df1.shape

(180, 1)

In [24]:
field1 = 'Farming'
field2 = 'Construction'
field3 = 'Factory worker'
field4 = 'Cleaner'
field5 = 'Security'
field6 = 'Coolie'

li = [field1, field2, field3, field4, field5, field6]

fieldlist = []

for i in range(int(180/6)):
    fieldlist.append(li[0])
for i in range(int(180/6)):
    fieldlist.append(li[1])
for i in range(int(180/6)):
    fieldlist.append(li[2])
for i in range(int(180/6)):
    fieldlist.append(li[3])
for i in range(int(180/6)):
    fieldlist.append(li[4])
for i in range(int(180/6)):
    fieldlist.append(li[5])

print(fieldlist)

['Farming', 'Farming', 'Farming', 'Farming', 'Farming', 'Farming', 'Farming', 'Farming', 'Farming', 'Farming', 'Farming', 'Farming', 'Farming', 'Farming', 'Farming', 'Farming', 'Farming', 'Farming', 'Farming', 'Farming', 'Farming', 'Farming', 'Farming', 'Farming', 'Farming', 'Farming', 'Farming', 'Farming', 'Farming', 'Farming', 'Construction', 'Construction', 'Construction', 'Construction', 'Construction', 'Construction', 'Construction', 'Construction', 'Construction', 'Construction', 'Construction', 'Construction', 'Construction', 'Construction', 'Construction', 'Construction', 'Construction', 'Construction', 'Construction', 'Construction', 'Construction', 'Construction', 'Construction', 'Construction', 'Construction', 'Construction', 'Construction', 'Construction', 'Construction', 'Construction', 'Factory worker', 'Factory worker', 'Factory worker', 'Factory worker', 'Factory worker', 'Factory worker', 'Factory worker', 'Factory worker', 'Factory worker', 'Factory worker', 'Factory worker', 'Factory worker', 'Factory worker', 'Factory worker', 'Factory worker', 'Factory worker', 'Factory worker', 'Factory worker', 'Factory worker', 'Factory worker', 'Factory worker', 'Factory worker', 'Factory worker', 'Factory worker', 'Factory worker', 'Factory worker', 'Factory worker', 'Factory worker', 'Factory worker', 'Factory worker', 'Cleaner', 'Cleaner', 'Cleaner', 'Cleaner', 'Cleaner', 'Cleaner', 'Cleaner', 'Cleaner', 'Cleaner', 'Cleaner', 'Cleaner', 'Cleaner', 'Cleaner', 'Cleaner', 'Cleaner', 'Cleaner', 'Cleaner', 'Cleaner', 'Cleaner', 'Cleaner', 'Cleaner', 'Cleaner', 'Cleaner', 'Cleaner', 'Cleaner', 'Cleaner', 'Cleaner', 'Cleaner', 'Cleaner', 'Cleaner', 'Security', 'Security', 'Security', 'Security', 'Security', 'Security', 'Security', 'Security', 'Security', 'Security', 'Security', 'Security', 'Security', 'Security', 'Security', 'Security', 'Security', 'Security', 'Security', 'Security', 'Security', 'Security', 'Security', 'Security', 'Security', 'Security', 'Security', 'Security', 'Security', 'Security', 'Coolie', 'Coolie', 'Coolie', 'Coolie', 'Coolie', 'Coolie', 'Coolie', 'Coolie', 'Coolie', 'Coolie', 'Coolie', 'Coolie', 'Coolie', 'Coolie', 'Coolie', 'Coolie', 'Coolie', 'Coolie', 'Coolie', 'Coolie', 'Coolie', 'Coolie', 'Coolie', 'Coolie', 'Coolie', 'Coolie', 'Coolie', 'Coolie', 'Coolie', 'Coolie']

In [28]:
import numpy as np
w = np.asarray(fieldlist)
df1['work'] = w

In [29]:
df1.head()

                                          name     work
5819                                    Boonty  Farming
503                                     Abazab  Farming
3732                          Automation Alley  Farming
5839  Bootstrap Digital and Tech Ventures Inc.  Farming
2715                            AppIt Ventures  Farming

In [30]:
df1 = sklearn.utils.shuffle(df1)

In [31]:
df1.head()

                name            work
3614     Audiosocket         Farming
1436     AgentBridge        Security
121    24x7 Learning        Security
2635       App Annie  Factory worker
1390  AFrame Digital  Factory worker

In [32]:
village = ['Aladakatti', 'Bandakeri', 'Budingod']
import random

village_gen = []
for i in range(int(180/3)):
    village_gen.append(village[0])
for i in range(int(180/3)):
    village_gen.append(village[1])
for i in range(int(180/3)):
    village_gen.append(village[2])

print(village_gen)

['Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Aladakatti', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Bandakeri', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod', 'Budingod']

In [33]:
v = np.asarray(village_gen)
df1['area'] = v

In [34]:
df1.head()

                name            work        area
3614     Audiosocket         Farming  Aladakatti
1436     AgentBridge        Security  Aladakatti
121    24x7 Learning        Security  Aladakatti
2635       App Annie  Factory worker  Aladakatti
1390  AFrame Digital  Factory worker  Aladakatti

In [35]:
df1 = sklearn.utils.shuffle(df1)
df1.head()

                         name            work        area
2101             Amba Defence  Factory worker    Budingod
5661            Boardwalktech  Factory worker    Budingod
1246                Advestigo    Construction  Aladakatti
2926  AquaBounty Technologies    Construction    Budingod
4444     BEAT BioTherapeutics         Farming    Budingod

In [36]:
df1.shape

(180, 3)

In [40]:
pay_list = [35, 40, 45, 50, 55, 60]

hourly_pay = []

for i in range(180):
    hourly_pay.append(random.choice(pay_list))

In [42]:
print(hourly_pay)

[55, 60, 60, 50, 35, 60, 45, 35, 40, 45, 45, 50, 40, 55, 45, 40, 60, 55, 45, 50, 55, 55, 55, 55, 35, 55, 35, 40, 35, 40, 40, 60, 35, 45, 35, 40, 55, 60, 45, 50, 40, 50, 40, 50, 40, 55, 60, 50, 55, 45, 60, 45, 55, 50, 40, 60, 45, 45, 40, 55, 60, 45, 50, 50, 45, 60, 40, 60, 45, 55, 55, 55, 35, 40, 60, 55, 40, 60, 55, 40, 40, 35, 35, 60, 60, 50, 35, 50, 50, 45, 55, 55, 35, 50, 60, 60, 55, 40, 45, 45, 55, 55, 60, 55, 45, 35, 55, 50, 55, 35, 35, 35, 50, 45, 55, 55, 40, 35, 50, 55, 50, 35, 60, 50, 55, 45, 60, 35, 40, 50, 35, 50, 45, 35, 55, 50, 50, 55, 40, 55, 40, 45, 55, 40, 50, 45, 55, 55, 40, 45, 40, 55, 45, 45, 40, 60, 45, 35, 45, 50, 45, 50, 45, 45, 40, 50, 50, 55, 45, 60, 50, 50, 60, 55, 35, 35, 55, 50, 45, 45]

In [43]:
daily_pay = []
for i in hourly_pay:
    daily_pay.append(i*7)
print(daily_pay)

[385, 420, 420, 350, 245, 420, 315, 245, 280, 315, 315, 350, 280, 385, 315, 280, 420, 385, 315, 350, 385, 385, 385, 385, 245, 385, 245, 280, 245, 280, 280, 420, 245, 315, 245, 280, 385, 420, 315, 350, 280, 350, 280, 350, 280, 385, 420, 350, 385, 315, 420, 315, 385, 350, 280, 420, 315, 315, 280, 385, 420, 315, 350, 350, 315, 420, 280, 420, 315, 385, 385, 385, 245, 280, 420, 385, 280, 420, 385, 280, 280, 245, 245, 420, 420, 350, 245, 350, 350, 315, 385, 385, 245, 350, 420, 420, 385, 280, 315, 315, 385, 385, 420, 385, 315, 245, 385, 350, 385, 245, 245, 245, 350, 315, 385, 385, 280, 245, 350, 385, 350, 245, 420, 350, 385, 315, 420, 245, 280, 350, 245, 350, 315, 245, 385, 350, 350, 385, 280, 385, 280, 315, 385, 280, 350, 315, 385, 385, 280, 315, 280, 385, 315, 315, 280, 420, 315, 245, 315, 350, 315, 350, 315, 315, 280, 350, 350, 385, 315, 420, 350, 350, 420, 385, 245, 245, 385, 350, 315, 315]

In [44]:
monthly_pay = []
for i in daily_pay:
    monthly_pay.append(i*25)
print(monthly_pay)

[9625, 10500, 10500, 8750, 6125, 10500, 7875, 6125, 7000, 7875, 7875, 8750, 7000, 9625, 7875, 7000, 10500, 9625, 7875, 8750, 9625, 9625, 9625, 9625, 6125, 9625, 6125, 7000, 6125, 7000, 7000, 10500, 6125, 7875, 6125, 7000, 9625, 10500, 7875, 8750, 7000, 8750, 7000, 8750, 7000, 9625, 10500, 8750, 9625, 7875, 10500, 7875, 9625, 8750, 7000, 10500, 7875, 7875, 7000, 9625, 10500, 7875, 8750, 8750, 7875, 10500, 7000, 10500, 7875, 9625, 9625, 9625, 6125, 7000, 10500, 9625, 7000, 10500, 9625, 7000, 7000, 6125, 6125, 10500, 10500, 8750, 6125, 8750, 8750, 7875, 9625, 9625, 6125, 8750, 10500, 10500, 9625, 7000, 7875, 7875, 9625, 9625, 10500, 9625, 7875, 6125, 9625, 8750, 9625, 6125, 6125, 6125, 8750, 7875, 9625, 9625, 7000, 6125, 8750, 9625, 8750, 6125, 10500, 8750, 9625, 7875, 10500, 6125, 7000, 8750, 6125, 8750, 7875, 6125, 9625, 8750, 8750, 9625, 7000, 9625, 7000, 7875, 9625, 7000, 8750, 7875, 9625, 9625, 7000, 7875, 7000, 9625, 7875, 7875, 7000, 10500, 7875, 6125, 7875, 8750, 7875, 8750, 7875, 7875, 7000, 8750, 8750, 9625, 7875, 10500, 8750, 8750, 10500, 9625, 6125, 6125, 9625, 8750, 7875, 7875]

In [45]:
hp = np.asarray(hourly_pay)
df1['hourly pay'] = hp

dp = np.asarray(daily_pay)
df1['daily pay'] = dp

mp = np.asarray(monthly_pay)
df1['monthly pay'] = mp

df1.head()

,name,work,area,hourly pay,daily pay,monthly pay
2101,Amba Defence,Factory worker,Budingod,55,385,9625
5661,Boardwalktech,Factory worker,Budingod,60,420,10500
1246,Advestigo,Construction,Aladakatti,60,420,10500
2926,AquaBounty Technologies,Construction,Budingod,50,350,8750
4444,BEAT BioTherapeutics,Farming,Budingod,35,245,6125

In [46]:
df1 = sklearn.utils.shuffle(df1)
df1.head()

,name,work,area,hourly pay,daily pay,monthly pay
1525,Ahead,Construction,Aladakatti,40,280,7000
5179,Bird Cycleworks,Security,Aladakatti,60,420,10500
1618,AIRTAME,Coolie,Budingod,40,280,7000
3996,Axtria,Coolie,Budingod,55,385,9625
503,Abazab,Farming,Aladakatti,50,350,8750

In [47]:
df1.to_csv(r'openings.csv', index = False)